## String Manipulation Functions

We use string manipulation functions quite extensively. Here are some of the important functions which we typically use.

* Case Conversion - `lower`, `upper`, `initcap`
* Getting size of the column value - `length`
* Extracting Data - `substr` and `split_part`
* Trimming and Padding functions - `trim`, `rtrim`, `ltrim`, `rpad` and `lpad`
* Reversing strings - `reverse`
* Concatenating multiple strings `concat` and `concat_ws`

### Case Conversion and Length
Let us understand how to perform case conversion of a string and also get length of a string.

In [1]:
%load_ext sql

In [2]:
##database 
%env DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

env: DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

* Case Conversion Functions - `lower`, `upper`, `initcap`

In [9]:
%%sql 
SELECT lower('ISMAIL MOHAMED') AS lower_result,
       upper('ismail mohamed') as upper_result,
       initcap('ismail mOHAMED') as initcap_result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('ismail mohamed', 'ISMAIL MOHAMED', 'Ismail Mohamed')]

* Getting length - `length`

In [10]:
%%sql

SELECT length('ISMAIL MOHAMED') AS length_result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(14,)]

Let us see how to use these functions on top of the table. We will use orders table which was loaded as part of last section.

* order_status for all the orders is in upper case and we will convert every thing to lower case.

In [11]:
%%sql

SELECT * FROM orders LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

##let's make all capital on order_staus values

In [21]:
%%sql 

SELECT upper(order_status) as uper_result , lower(order_status) as lower_result,initcap(order_status) as init_cap,
length(order_status) as order_status_length
from orders 
limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[('CLOSED', 'closed', 'Closed', 6),
 ('PENDING_PAYMENT', 'pending_payment', 'Pending_Payment', 15),
 ('COMPLETE', 'complete', 'Complete', 8),
 ('CLOSED', 'closed', 'Closed', 6),
 ('COMPLETE', 'complete', 'Complete', 8),
 ('COMPLETE', 'complete', 'Complete', 8),
 ('COMPLETE', 'complete', 'Complete', 8),
 ('PROCESSING', 'processing', 'Processing', 10),
 ('PENDING_PAYMENT', 'pending_payment', 'Pending_Payment', 15),
 ('PENDING_PAYMENT', 'pending_payment', 'Pending_Payment', 15)]

### Extracting Data - substr and split_part
Let us understand how to extract data from strings using `substr`/`substring` as well as `split_part`.

* We can extract sub string from main string using `substr` or `substring` position and length.
* For example, get first 4 characters from date to get year or get last 4 characters from fixed length unique id.
* `substring` have broader options (regular expression) and also can be used with different styles (using keywords such as `FROM`, `FOR`).
* Unlike in other relational databases, we cannot pass negative integers to `substr` or `substring` to get the information from right. We need to use functions like `right` instead.

In [24]:
%%sql 
SELECT initcap(substr('Ismail Mohamud',1,6)) as ismail

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Ismail',)]

In [25]:
%%sql

SELECT substr('2013-07-25 00:00:00.0', 1, 4) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('2013',)]

In [26]:
%%sql

SELECT substring('2013-07-25 00:00:00.0', 1, 4) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('2013',)]

In [21]:
%%sql

SELECT substring('2013-07-25 00:00:00.0' FROM 1 FOR 4) AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('2013',)]

In [24]:
%%sql

SELECT substring('2013-07-25 00:00:00.0' from 12) AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('00:00:00.0',)]

In [27]:
%%sql 

SELECT right('Ismail Liigyare',8) as liigyare

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Liigyare',)]

In [31]:
%%sql 
SELECT left('Mohamud Ismail',7) as Mohamud

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Mohamud',)]

In [32]:
%%sql
SELECT right('123 456 7890', 4) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('7890',)]

In [30]:
%%sql

SELECT left('123 456 7890', 3) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('123',)]

In [35]:
%%sql 
select substring(order_status,1,3) as substring from orders limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[('CLO',),
 ('PEN',),
 ('COM',),
 ('CLO',),
 ('COM',),
 ('COM',),
 ('COM',),
 ('PRO',),
 ('PEN',),
 ('PEN',)]

```{note}
Getting first 3 characters or digits as well as last 4 characters or digits using `substring`. However, this works only when the strings are of fixed length.
```

* Let us see how we can extract date part from order_date of orders.

In [38]:
%%sql

SELECT * FROM orders LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

In [44]:
%%sql 
select order_date,substring(order_date::varchar , 1,10) as date from orders limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25'),
 (datetime.datetime(2013, 7, 25, 0, 0), '2013-07-25')]

Let us understand how to extract the information from the string where there is a delimiter.
* `split_part` can be used to split a string using delimiter and extract the information.
* If there is no data in a given position after splitting, it will be represented as empty string **''**.

In [47]:
%%sql

SELECT split_part('2013-07-25', '-', 1) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('2013',)]

In [54]:
%%sql 
SELECT split_part('2013-07-25','-' ,1) as order_date_result from orders limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[('2013',),
 ('2013',),
 ('2013',),
 ('2013',),
 ('2013',),
 ('2013',),
 ('2013',),
 ('2013',),
 ('2013',),
 ('2013',)]

In [55]:
%%sql

WITH addresses AS (
    SELECT '593 Fair Oaks Pass, Frankfort, Kentucky, 40618' AS address UNION
    SELECT ', Vancouver, Washington, 98687' UNION
    SELECT '83047 Glacier Hill Circle, Sacramento, California, 94237' UNION
    SELECT '935 Columbus Junction, Cincinnati, Ohio, 45213' UNION
    SELECT '03010 Nevada Crossing, El Paso, Texas, 88579' UNION
    SELECT '9 Dunning Circle, , Arizona, 85271' UNION
    SELECT '96 Fair Oaks Way, Decatur, Illinois, 62525' UNION
    SELECT '999 Caliangt Avenue, Greenville, South Carolina, 29615' UNION
    SELECT '2 Saint Paul Trail, Bridgeport, , 06673' UNION
    SELECT '3 Reindahl Center, Ogden, Utah'
) SELECT split_part(address, ', ', 1) street,
    split_part(address, ', ', 2) city,
    split_part(address, ', ', 3) state,
    split_part(address, ', ', 4) postal_code
FROM addresses
ORDER BY postal_code

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[('3 Reindahl Center', 'Ogden', 'Utah', ''),
 ('2 Saint Paul Trail', 'Bridgeport', '', '06673'),
 ('999 Caliangt Avenue', 'Greenville', 'South Carolina', '29615'),
 ('593 Fair Oaks Pass', 'Frankfort', 'Kentucky', '40618'),
 ('935 Columbus Junction', 'Cincinnati', 'Ohio', '45213'),
 ('96 Fair Oaks Way', 'Decatur', 'Illinois', '62525'),
 ('9 Dunning Circle', '', 'Arizona', '85271'),
 ('03010 Nevada Crossing', 'El Paso', 'Texas', '88579'),
 ('83047 Glacier Hill Circle', 'Sacramento', 'California', '94237'),
 ('', 'Vancouver', 'Washington', '98687')]

In [56]:
%%sql

WITH addresses AS (
    SELECT '593 Fair Oaks Pass, Frankfort, Kentucky, 40618' AS address UNION
    SELECT ', Vancouver, Washington, 98687' UNION
    SELECT '83047 Glacier Hill Circle, Sacramento, California, 94237' UNION
    SELECT '935 Columbus Junction, Cincinnati, Ohio, 45213' UNION
    SELECT '03010 Nevada Crossing, El Paso, Texas, 88579' UNION
    SELECT '9 Dunning Circle, , Arizona, 85271' UNION
    SELECT '96 Fair Oaks Way, Decatur, Illinois, 62525' UNION
    SELECT '999 Caliangt Avenue, Greenville, South Carolina, 29615' UNION
    SELECT '2 Saint Paul Trail, Bridgeport, , 06673' UNION
    SELECT '3 Reindahl Center, Ogden, Utah'
) SELECT split_part(address, ', ', 1) street,
    split_part(address, ', ', 2) city,
    split_part(address, ', ', 3) state,
    split_part(address, ', ', 4) postal_code
FROM addresses
WHERE split_part(address, ', ', 1) = ''
ORDER BY postal_code

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('', 'Vancouver', 'Washington', '98687')]

In [57]:
%%sql

WITH unique_ids AS (
    SELECT '241-80-7115' AS unique_id UNION
    SELECT '694-30-6851' UNION
    SELECT '586-92-5361' UNION
    SELECT '884-65-284' UNION
    SELECT '876-99-585' UNION
    SELECT '831-59-5593' UNION
    SELECT '399-88-3617' UNION
    SELECT '733-17-4217' UNION
    SELECT '873-68-9778' UNION
    SELECT '480-69-032'
) SELECT unique_id,
    substring(unique_id FROM 1 FOR 3) AS unique_id_first3,
    substring(unique_id FROM '....$') AS unique_id_last4,
    CASE WHEN length(split_part(unique_id, '-', 3)) = 4
        THEN split_part(unique_id, '-', 3)
        ELSE 'Invalid'
    END AS unique_id_last
FROM unique_ids
ORDER BY unique_id

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[('241-80-7115', '241', '7115', '7115'),
 ('399-88-3617', '399', '3617', '3617'),
 ('480-69-032', '480', '-032', 'Invalid'),
 ('586-92-5361', '586', '5361', '5361'),
 ('694-30-6851', '694', '6851', '6851'),
 ('733-17-4217', '733', '4217', '4217'),
 ('831-59-5593', '831', '5593', '5593'),
 ('873-68-9778', '873', '9778', '9778'),
 ('876-99-585', '876', '-585', 'Invalid'),
 ('884-65-284', '884', '-284', 'Invalid')]

### Using position or strpos

At times we might want to get the position of a substring in a main string. For example, we might want to check whether email ids have **@** in them. We can use functions such as `position` or `strpos`.

In [60]:
%%sql 

SELECT position('I' IN 'ismail')

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(0,)]

In [61]:
%%sql 
SELECT position('@' IN 'iamismail@gmail.com')

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(10,)]

In [63]:
%%sql 
SELECT strpos ('iamismail@gmail.com','@')

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(10,)]

### Trimming and Padding Functions

Let us understand how to trim or remove leading and/or trailing spaces in a string.

* `ltrim` is used to remove the spaces on the left side of the string.
* `rtrim` is used to remove the spaces on the right side of the string.
* `trim` is used to remove the spaces on both sides of the string.

In [44]:
%%sql

SELECT ltrim('     Hello World') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('Hello World',)]

In [65]:
%%sql

SELECT rtrim('Hello World    ') AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Hello World',)]

In [66]:
%%sql

SELECT length(trim('     Hello World       ')) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(11,)]

In [47]:
%%sql

SELECT ltrim('----Hello World----', '-') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('Hello World----',)]

In [67]:
%%sql

SELECT rtrim('----Hello World----', '-') AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('----Hello World',)]

In [68]:
%%sql

SELECT trim('----Hello World----', '-') AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Hello World',)]

Let us understand how to use padding to pad characters to a string.

* Let us assume that there are 3 fields - year, month and date which are of type integer.
* If we have to concatenate all the 3 fields and create a date, we might have to pad month and date with 0.
* `lpad` is used more often than `rpad` especially when we try to build the date from separate columns.

In [50]:
%%sql

SELECT 2013 AS year, 7 AS month, 25 AS myDate

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[(2013, 7, 25)]

In [51]:
%%sql

SELECT lpad(7::varchar, 2, '0') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('07',)]

In [52]:
%%sql

SELECT lpad(10::varchar, 2, '0') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('10',)]

In [53]:
%%sql

SELECT lpad(100::varchar, 2, '0') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('10',)]

### Reverse and Concatenating multiple strings

Let us understand how to reverse a string as well as concatenate multiple strings.

* We can use `reverse` to reverse a string.
* We can concatenate multiple strings using `concat` and `concat_ws`.
* `concat_ws` is typically used if we want to have the same string between all the strings that are being concatenated.

In [70]:
%%sql 
SELECT reverse('Ismail') as result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('liamsI',)]

In [71]:
%%sql 
SELECT reverse('iamismail') as result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('liamsimai',)]

In [57]:
%%sql

SELECT reverse('Hello World') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('dlroW olleH',)]

In [72]:
%%sql

SELECT concat('Hello ', 'World') AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Hello World',)]

In [74]:
%%sql 
SELECT concat('The status of the order is ', order_status) as result from 
orders limit 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[('The status of the order is CLOSED',),
 ('The status of the order is PENDING_PAYMENT',),
 ('The status of the order is COMPLETE',),
 ('The status of the order is CLOSED',),
 ('The status of the order is COMPLETE',),
 ('The status of the order is COMPLETE',),
 ('The status of the order is COMPLETE',),
 ('The status of the order is PROCESSING',),
 ('The status of the order is PENDING_PAYMENT',),
 ('The status of the order is PENDING_PAYMENT',)]

In [75]:
%%sql

SELECT * FROM (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(2013, 7, 25)]

In [78]:
%%sql

SELECT concat(year, '-', lpad(month::varchar, 2, '0'), '-',
              lpad(myDate::varchar, 2, '0')) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('2013-07-25',)]

In [77]:
%%sql

SELECT concat_ws('-', year, lpad(month::varchar, 2, '0'),
              lpad(myDate::varchar, 2, '0')) AS order_date
FROM
    (SELECT 2013 AS year, 7 AS month, 25 AS myDate) q

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('2013-07-25',)]

### String Replacement

Let us go through the details related to string replacement.

* `replace` can be used to replace a sub string with in a string with another string.
* `overlay` can be used to replace a sub string with in a string by position with another string.
* `translate` can be used to replace individual characters with other characters.

In [84]:
%%sql 
SELECT replace ('Ismal' , 'HELLO','HELLO') as result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Ismal',)]

In [79]:
%%sql

SELECT replace('Hello World', 'alo', 'ello') AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Hello World',)]

In [85]:
%%sql

SELECT overlay('Hala World' PLACING 'ello' FROM 2 FOR 3) AS result

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[('Hello World',)]

In [68]:
%%sql

WITH unique_ids AS (
    SELECT '241-80-7115' AS unique_id UNION
    SELECT '694-30-6851' UNION
    SELECT '586-92-5361' UNION
    SELECT '884-65-2844' UNION
    SELECT '876-99-5856' UNION
    SELECT '831-59-5593' UNION
    SELECT '399-88-3617' UNION
    SELECT '733-17-4217' UNION
    SELECT '873-68-9778' UNION
    SELECT '487-21-9802'
) SELECT unique_id,
    replace(unique_id, '-', ' ') AS unique_id_replaced,
    translate(unique_id, '-', ' ') AS unique_id_translated,
    overlay(unique_id PLACING ' ' FROM 4 FOR 1) AS unique_id_overlaid
FROM unique_ids
ORDER BY unique_id

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[('241-80-7115', '241 80 7115', '241 80 7115', '241 80-7115'),
 ('399-88-3617', '399 88 3617', '399 88 3617', '399 88-3617'),
 ('487-21-9802', '487 21 9802', '487 21 9802', '487 21-9802'),
 ('586-92-5361', '586 92 5361', '586 92 5361', '586 92-5361'),
 ('694-30-6851', '694 30 6851', '694 30 6851', '694 30-6851'),
 ('733-17-4217', '733 17 4217', '733 17 4217', '733 17-4217'),
 ('831-59-5593', '831 59 5593', '831 59 5593', '831 59-5593'),
 ('873-68-9778', '873 68 9778', '873 68 9778', '873 68-9778'),
 ('876-99-5856', '876 99 5856', '876 99 5856', '876 99-5856'),
 ('884-65-2844', '884 65 2844', '884 65 2844', '884 65-2844')]

In [69]:
%%sql

WITH unique_ids AS (
    SELECT '241-80-7115' AS unique_id UNION
    SELECT '694-30:6851' UNION
    SELECT '586-92-5361' UNION
    SELECT '884:65-2844' UNION
    SELECT '876/99-5856' UNION
    SELECT '831-59:5593' UNION
    SELECT '399-88-3617' UNION
    SELECT '733:17-4217' UNION
    SELECT '873:68-9778' UNION
    SELECT '487-21/9802'
) SELECT unique_id,
    replace(replace(unique_id, '-', ' '), ':', ' ') AS unique_id_replaced,
    translate(unique_id, '-:/', '   ') AS unique_id_translated,
    overlay(overlay(unique_id PLACING ' ' FROM 4 FOR 1) PLACING ' ' FROM 7 FOR 1) AS unique_id_overlaid
FROM unique_ids
ORDER BY unique_id

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[('241-80-7115', '241 80 7115', '241 80 7115', '241 80 7115'),
 ('399-88-3617', '399 88 3617', '399 88 3617', '399 88 3617'),
 ('487-21/9802', '487 21/9802', '487 21 9802', '487 21 9802'),
 ('586-92-5361', '586 92 5361', '586 92 5361', '586 92 5361'),
 ('694-30:6851', '694 30 6851', '694 30 6851', '694 30 6851'),
 ('733:17-4217', '733 17 4217', '733 17 4217', '733 17 4217'),
 ('831-59:5593', '831 59 5593', '831 59 5593', '831 59 5593'),
 ('873:68-9778', '873 68 9778', '873 68 9778', '873 68 9778'),
 ('876/99-5856', '876/99 5856', '876 99 5856', '876 99 5856'),
 ('884:65-2844', '884 65 2844', '884 65 2844', '884 65 2844')]

```{note}
In case of `translate`, if we do not have characters for replacement, then those will be replaced with empty string. For example, `translate('+86 (238) 954-9649', '+() -', '0')`will result in **0862389549649**.
```

In [70]:
%%sql

SELECT translate('+86 (238) 954-9649', '+() -', '0') AS result

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
1 rows affected.

[('0862389549649',)]

In [71]:
%%sql

WITH phone_numbers AS (
    SELECT '+86 (238) 954-9649' AS phone_number UNION
    SELECT '+420 (331) 900-5807' UNION
    SELECT '+1 (320) 484-4495' UNION
    SELECT '+45 (238) 961-9801' UNION
    SELECT '+51 (123) 545-6543' UNION
    SELECT '+63 (308) 354-2560' UNION
    SELECT '+86 (433) 851-1260' UNION
    SELECT '+63 (332) 705-0319' UNION
    SELECT '+351 (147) 359-3767' UNION
    SELECT '+57 (714) 557-0468'
) SELECT phone_number, 
    translate(phone_number, '+() -', '') phone_number_int
FROM phone_numbers
ORDER BY phone_number

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[('+1 (320) 484-4495', '13204844495'),
 ('+351 (147) 359-3767', '3511473593767'),
 ('+420 (331) 900-5807', '4203319005807'),
 ('+45 (238) 961-9801', '452389619801'),
 ('+51 (123) 545-6543', '511235456543'),
 ('+57 (714) 557-0468', '577145570468'),
 ('+63 (308) 354-2560', '633083542560'),
 ('+63 (332) 705-0319', '633327050319'),
 ('+86 (238) 954-9649', '862389549649'),
 ('+86 (433) 851-1260', '864338511260')]